simulationV2/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    tube_inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    tube_outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    shell_inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    shell_outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    shell_wall
    {
        type            calculated;
        value           $internalField;
}

// ************************************************************************* //
