simulationV2/0/shell_fluid/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/shell_fluid";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    shell_outlet
    {
        type            calculated;
        value           uniform 0;
    }
    shell_wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    shell_inlet
    {
        type            calculated;
        value           uniform 0;
    }
    shell_fluid_to_tube_fluid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
